tap "amazon/amazon", "ssh://git.amazon.com/pkg/HomebrewAmazon"
tap "amzn/amzn", "https://git-codecommit.us-west-2.amazonaws.com/v1/repos/HomebrewAmazon"
tap "cmacrae/formulae"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "majd/repo"
brew "libpng"
brew "python@3.11"
brew "awscli"
brew "gcc"
brew "btop"
brew "cliclick"
brew "dbus"
brew "ffmpeg"
brew "ffmpeg@4"
brew "fzf"
brew "git"
brew "gobject-introspection"
brew "htop"
brew "ifstat"
brew "iperf3"
brew "jq"
brew "knot"
brew "knot-resolver"
brew "lua"
brew "mas"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "node"
brew "python@3.10"
brew "node@14"
brew "nvm"
brew "p7zip"
brew "python@3.9"
brew "rsync"
brew "ruby"
brew "scrcpy"
brew "shellcheck"
brew "starship"
brew "terminal-notifier"
brew "thefuck"
brew "vapoursynth"
brew "wakeonlan"
brew "web-ext"
brew "wget"
brew "yarn"
brew "yt-dlp"
brew "amzn/amzn/ninja-dev-sync"
brew "cmacrae/formulae/spacebar"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "agenda"
cask "alt-tab"
cask "android-file-transfer"
cask "android-platform-tools"
cask "appcleaner"
cask "authy"
cask "azure-data-studio"
cask "brave-browser"
cask "browserosaurus"
cask "cyberduck"
cask "datagrip"
cask "dcv-viewer"
cask "docker"
cask "firefox@developer-edition"
cask "firefox@esr"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "fx-cast-bridge"
cask "hammerspoon"
cask "hiddenbar"
cask "intellij-idea"
cask "ipatool"
cask "iterm2"
cask "jellyfin-media-player"
cask "karabiner-elements"
cask "keepingyouawake"
cask "kindle"
cask "kodi"
cask "logitech-g-hub"
cask "lunar"
cask "maccy"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-edge@dev"
cask "monitorcontrol"
cask "moonlight"
cask "mos"
cask "motrix"
cask "nextcloud"
cask "orion"
cask "postman"
cask "sf-symbols"
cask "spotify"
cask "stats"
cask "sublime-text"
cask "table-tool"
cask "thunderbird"
cask "unnaturalscrollwheels"
cask "visual-studio-code"
cask "warp"
cask "wiznote"
mas "AdGuard Home", id: 1543143740
mas "Agenda", id: 1287445660
mas "AudioBookBinder", id: 413969927
mas "Bitwarden", id: 1352778147
mas "Fresco", id: 1251572132
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "iMovie", id: 408981434
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Kindle Classic", id: 405399194
mas "LocalSend", id: 1661733229
mas "Microsoft OneNote", id: 784801555
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Podurama", id: 1497491520
mas "Saber", id: 1671523739
mas "Steam Link", id: 1246969117
mas "Swol", id: 1502303446
mas "Tailscale", id: 1475387142
mas "The Unarchiver", id: 425424353
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "emroussel.atomize-atom-one-dark-theme"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "lpubsppop01.vscode-auto-timestamp"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "pkief.material-icon-theme"
vscode "twxs.cmake"
vscode "vscode-icons-team.vscode-icons"
vscode "zhuangtongfa.material-theme"
