tap "amazon/amazon", "ssh://git.amazon.com/pkg/HomebrewAmazon"
tap "amzn/amzn", "https://git-codecommit.us-west-2.amazonaws.com/v1/repos/HomebrewAmazon"
tap "cmacrae/formulae"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "lihaoyun6/tap"
tap "majd/repo"
tap "nikitabobko/tap"
tap "null-dev/firefox-profile-switcher"
# Library for manipulating PNG images
brew "libpng"
# Official Amazon AWS command-line interface
brew "awscli"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Tool for emulating mouse and keyboard events
brew "cliclick"
# Message bus system, providing inter-application communication
brew "dbus"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Tool to report network interface bandwidth
brew "ifstat"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# High-performance authoritative-only DNS server
brew "knot"
# Minimalistic, caching, DNSSEC-validating DNS resolver
brew "knot-resolver"
# Powerful, lightweight programming language
brew "lua"
# Mac App Store command-line interface
brew "mas"
# Video processing framework with simplicity in mind
brew "vapoursynth"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Open-source, cross-platform JavaScript runtime environment
brew "node@20"
# Manage multiple Node.js versions
brew "nvm"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Display and control your Android device
brew "scrcpy"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Command-line tool to customize Spotify client
brew "spicetify-cli", link: false
# Cross-shell prompt for astronauts
brew "starship"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Programmatically correct mistyped console commands
brew "thefuck"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Command-line tool to help build, run, and test web extensions
brew "web-ext"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Brazil workspace sync tool
brew "amzn/amzn/ninja-dev-sync"
# A minimal status bar for macOS.
brew "cmacrae/formulae/spacebar"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# The native component of the Profile Switcher for Firefox extension.
brew "null-dev/firefox-profile-switcher/firefox-profile-switcher-connector"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Note taking application focusing on dates
cask "agenda"
# Get the battery level of all your devices on your Mac.
cask "airbattery"
# Enable Windows-like alt-tab
cask "alt-tab"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# User-friendly GUI app for Homebrew
cask "applite"
# Data management tool that enables working with SQL Server
cask "azure-data-studio"
# Universal chat app powered by Matrix
cask "beeper"
# Web browser focusing on privacy
cask "brave-browser"
# Open-source browser prompter
cask "browserosaurus"
# Server and cloud storage browser
cask "cyberduck"
# Databases and SQL IDE
cask "datagrip"
# Client for NICE DCV remote display protocol
cask "dcv-viewer"
# Utilities designed to make common development tasks easier
cask "devtoys"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Web browser
cask "firefox@developer-edition"
# Web browser
cask "firefox@esr"
# Virtual workspace manager
cask "flashspace"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
# Bridge helper for fx_cast Firefox extension to enable Chromecast support
cask "fx-cast-bridge"
# Desktop automation application
cask "hammerspoon"
# Utility to hide menu bar items
cask "hiddenbar"
# Java IDE by JetBrains
cask "intellij-idea"
# CLI tool for searching and downloading iOS app packages from the App Store
cask "ipatool"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Jellyfin desktop client
cask "jellyfin-media-player"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Interface for reading and syncing eBooks
cask "kindle"
# Free and open-source media player
cask "kodi"
# Customise mouse behavior
cask "linearmouse"
# Support for Logitech G gear
cask "logitech-g-hub"
# Adaptive brightness for external displays
cask "lunar"
# Clipboard manager
cask "maccy"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Multi-platform web browser
cask "microsoft-edge@dev"
# Utility to extend trackpad functionality
cask "middleclick"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# GameStream client
cask "moonlight"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Open-source download manager
cask "motrix"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# System and utility switches
cask "only-switch"
# WebKit based web browser
cask "orion"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Podcast platform
cask "pocket-casts"
# Collaboration platform for API development
cask "postman"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# App that enables mouse-free UI interaction
cask "shortcat"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Media player based on MPlayer and mplayer2
cask "stolendata-mpv"
# Text editor for code, markup and prose
cask "sublime-text"
# CSV file editor
cask "table-tool"
# Windows-style taskbar as a Dock replacement
cask "taskbar"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Customizable email client
cask "thunderbird"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Rust-based terminal
cask "warp"
mas "AdGuardHome", id: 1543143740
mas "Agenda", id: 1287445660
mas "AudioBookBinder", id: 413969927
mas "Bitwarden", id: 1352778147
mas "Dropover", id: 1355679052
mas "Folder Hub", id: 6473019059
mas "Goodnotes", id: 1444383602
mas "Hyperduck", id: 6444667067
mas "Irvue", id: 1039633667
mas "Kindle", id: 302584613
mas "LocalSend", id: 1661733229
mas "MeetingMenu", id: 6538714770
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Podurama", id: 1497491520
mas "Saber", id: 1671523739
mas "Steam Link", id: 1246969117
mas "Swol", id: 1502303446
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
vscode "asbx.amzn-cline"
vscode "boto3typed.boto3-ide"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "emroussel.atomize-atom-one-dark-theme"
vscode "esbenp.prettier-vscode"
vscode "gerrythemes.gerrythemes"
vscode "k--kato.intellij-idea-keybindings"
vscode "lpubsppop01.vscode-auto-timestamp"
vscode "marklel.vscode-brazil"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "zhuangtongfa.material-theme"
