tap "amazon/amazon", "ssh://git.amazon.com/pkg/HomebrewAmazon"
tap "cmacrae/formulae"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "libpng"
brew "gcc"
brew "btop"
brew "python@3.9"
brew "cliclick"
brew "dbus"
brew "ffmpeg"
brew "ffmpeg@4"
brew "fzf"
brew "git"
brew "python@3.10"
brew "gobject-introspection"
brew "htop"
brew "ifstat"
brew "iperf3"
brew "jq"
brew "knot-resolver"
brew "lua"
brew "mas"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "node"
brew "p7zip"
brew "python@3.11"
brew "rsync"
brew "ruby"
brew "scrcpy"
brew "shellcheck"
brew "starship"
brew "terminal-notifier"
brew "vapoursynth"
brew "wakeonlan"
brew "wget"
brew "yarn"
brew "yt-dlp"
brew "amazon/amazon/ninja-dev-sync"
brew "cmacrae/formulae/spacebar"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "agenda"
cask "amazon-music"
cask "android-file-transfer"
cask "android-platform-tools"
cask "appcleaner"
cask "authy"
cask "azure-data-studio"
cask "cyberduck"
cask "datagrip"
cask "dcv-viewer"
cask "firefox-developer-edition"
cask "firefox-esr"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "hammerspoon"
cask "hiddenbar"
cask "intellij-idea"
cask "iterm2"
cask "jellyfin-media-player"
cask "karabiner-elements"
cask "keepingyouawake"
cask "kindle"
cask "kodi"
cask "logitech-g-hub"
cask "maccy"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-edge-dev"
cask "monitorcontrol"
cask "mos"
cask "motrix"
cask "nextcloud"
cask "orion"
cask "postman"
cask "quip"
cask "sf-symbols"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "table-tool"
cask "unnaturalscrollwheels"
cask "visual-studio-code"
cask "warp"
cask "wiznote"
mas "AdGuard Home", id: 1543143740
mas "AudioBookBinder", id: 413969927
mas "Bitwarden", id: 1352778147
mas "Fresco", id: 1251572132
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Podurama", id: 1497491520
mas "Swol", id: 1502303446
mas "The Unarchiver", id: 425424353
